 
                              Fusion Compiler (TM)

                Version W-2024.09-SP3 for linux64 - Jan 16, 2025
  This release has significant feature enhancements. Please review the Release
                       Notes associated with this release.

                    Copyright (c) 1988 - 2025 Synopsys, Inc.
   This software and the associated documentation are proprietary to Synopsys,
 Inc. This software may only be used in accordance with the terms and conditions
 of a written license agreement with Synopsys, Inc. All other use, reproduction,
   or distribution of this software is strictly prohibited.  Licensed Products
     communicate with Synopsys servers for the purpose of providing software
    updates, detecting software piracy and verifying that customers are using
    Licensed Products in conformity with the applicable License Key for such
  Licensed Products. Synopsys will use information gathered in connection with
    this process to deliver software updates and pursue software pirates and
                                   infringers.

 Inclusivity & Diversity - Visit SolvNetPlus to read the "Synopsys Statement on
            Inclusivity and Diversity" (Refer to article 000036315 at
                        https://solvnetplus.synopsys.com)

Information: Term was not able to be set up using xterm-256color . Using "xterm" by default instead. (CLE-10)
fc_shell> 
fc_shell> puts "<<<CODE:CHF-011>>>"
<<<CODE:CHF-011>>>
fc_shell> 
fc_shell> 
fc_shell> man CHF-011
N.  Messages                                                 Command Reference
                                   messages

NAME
       CHF-011 (Warning) filler ref cell %s not marked filler type.

DESCRIPTION
       You  received  this warning message because your filler ref cell is not
       marked filler type.

WHAT NEXT
       Please check your filler ref cell type.

                          Version W-2024.09-SP3
            Copyright (c) 2025 Synopsys, Inc. All rights reserved.
fc_shell> 
fc_shell> 
fc_shell> puts "<<<END>>>"
<<<END>>>
fc_shell> 
fc_shell> 
fc_shell> puts "<<<CODE:CHF-014>>>"
<<<CODE:CHF-014>>>
fc_shell> 
fc_shell> 
fc_shell> man CHF-014
N.  Messages                                                 Command Reference
                                   messages

NAME
       CHF-014 (Warning) option -continue_on_error turned on automatically.

DESCRIPTION
       You  receive  this  warning  message  because you did not specify -con-
       tinue_on_error and  -rules  {  no_1x},  and  doesn't  provide  size  1x
       fillers.  Tool therefore turn on -continue_on_error automatically so it
       will skip unfillable 1x gaps and continue to fill the  rest.  This  may
       lead to unfillable gaps.

WHAT NEXT
       Please include fillers of all needed sizes

                          Version W-2024.09-SP3
            Copyright (c) 2025 Synopsys, Inc. All rights reserved.
fc_shell> 
fc_shell> 
fc_shell> puts "<<<END>>>"
<<<END>>>
fc_shell> 
fc_shell> 
fc_shell> puts "<<<CODE:CHF-073>>>"
<<<CODE:CHF-073>>>
fc_shell> 
fc_shell> 
fc_shell> man CHF-073
N.  Messages                                                 Command Reference
                                   messages

NAME
       CHF-073 (Warning) Smallest filler provided is greater than specified in
       option place.rules.min_vt_filler_size

DESCRIPTION
       The smallest fillers specified in  "create_stdcell_fillers  -lib_cells"
       is     larger    than    what    is    specified    in    app    option
       place.rules.min_vt_filler_size. This may cause unfillable gaps.

WHAT NEXT
       Please  include  missing   size   fillers   in   create_stdcell_fillers
       -lib_cells.

                          Version W-2024.09-SP3
            Copyright (c) 2025 Synopsys, Inc. All rights reserved.
fc_shell> 
fc_shell> 
fc_shell> puts "<<<END>>>"
<<<END>>>
fc_shell> 
fc_shell> 
fc_shell> puts "<<<CODE:CMD-013>>>"
<<<CODE:CMD-013>>>
fc_shell> 
fc_shell> 
fc_shell> man CMD-013
N.  Messages                                                 Command Reference
                                   messages

NAME
       CMD-013 (error) %s Use error_info for more info.

DESCRIPTION
       A  script  or complex command failed and there is a stack trace for the
       failure.  The trace points out the source files  and  loops  where  the
       error occurred.  The error_info command is used to display this stack.

WHAT NEXT
       Fix the error indicated by error_info.

                          Version W-2024.09-SP3
            Copyright (c) 2025 Synopsys, Inc. All rights reserved.
fc_shell> 
fc_shell> 
fc_shell> puts "<<<END>>>"
<<<END>>>
fc_shell> 
fc_shell> 
fc_shell> puts "<<<CODE:CMD-030>>>"
<<<CODE:CMD-030>>>
fc_shell> 
fc_shell> 
fc_shell> man CMD-030
N.  Messages                                                 Command Reference
                                   messages

NAME
       CMD-030 (warning) File '%s' was not found in search path.

DESCRIPTION
       The 'which' command evaluated an filename argument and the file was not
       found.

WHAT NEXT
       No adverse effect on the result of the  command,  but  check  spelling,
       etc.

                          Version W-2024.09-SP3
            Copyright (c) 2025 Synopsys, Inc. All rights reserved.
fc_shell> 
fc_shell> 
fc_shell> puts "<<<END>>>"
<<<END>>>
fc_shell> 
fc_shell> 
fc_shell> puts "<<<CODE:CTS-956>>>"
<<<CODE:CTS-956>>>
fc_shell> 
fc_shell> 
fc_shell> man CTS-956
N.  Messages                                                 Command Reference
                                   messages

NAME
       CTS-956  (warning) Please use -largest / -smallest / -all switches with
       -show_verbose_paths / -show_paths to report the clock paths.

DESCRIPTION
       -largest / -smallest /  -all  switches  have  to  add  with  -show_ver-
       bose_paths / -show_paths to report the clock paths.

WHAT NEXT
       Add -largest / -smallest / -all switches to report the clock paths.

                          Version W-2024.09-SP3
            Copyright (c) 2025 Synopsys, Inc. All rights reserved.
fc_shell> 
fc_shell> 
fc_shell> puts "<<<END>>>"
<<<END>>>
fc_shell> 
fc_shell> 
fc_shell> puts "<<<CODE:EOPT-011>>>"
<<<CODE:EOPT-011>>>
fc_shell> 
fc_shell> 
fc_shell> man EOPT-011
N.  Messages                                                 Command Reference
                                   messages

NAME
       EOPT-011 (Error) : '%d' errors encountered.

DESCRIPTION
       This  message  indicates  that errors are encountered during changelist
       implentation.

WHAT NEXT
       User can examine the changelist output txt file for more details.

SEE ALSO
       eco_opt (2).  check_pt_qor (2).

                          Version W-2024.09-SP3
            Copyright (c) 2025 Synopsys, Inc. All rights reserved.
fc_shell> 
fc_shell> 
fc_shell> puts "<<<END>>>"
<<<END>>>
fc_shell> 
fc_shell> 
fc_shell> puts "<<<CODE:FRAM-054>>>"
<<<CODE:FRAM-054>>>
fc_shell> 
fc_shell> 
fc_shell> man FRAM-054
N.  Messages                                                 Command Reference
                                   messages

NAME
       FRAM-054  (warning)  Technology  used  to create frame-view and current
       technology have inconsistency: %s.

DESCRIPTION
       The reported part of the technology are inconsistent between the refer-
       ence library and the design library.

WHAT NEXT
       Update the library with consistent technology and try again.

SEE ALSO
       create_lib(2)
       open_lib(2)
       read_tech_file(2)

                          Version W-2024.09-SP3
            Copyright (c) 2025 Synopsys, Inc. All rights reserved.
fc_shell> 
fc_shell> 
fc_shell> puts "<<<END>>>"
<<<END>>>
fc_shell> 
fc_shell> 
fc_shell> puts "<<<CODE:LEFW-005>>>"
<<<CODE:LEFW-005>>>
fc_shell> 
fc_shell> 
fc_shell> man LEFW-005
N.  Messages                                                 Command Reference
                                   messages

NAME
       LEFW-005  (warning)  Block  '%s'  has no %s view with empty label, will
       ignore it.

DESCRIPTION
       The reported block has no frame view  with  empty  label.  It  will  be
       ignored.

WHAT NEXT
       Please  create  frame  view for the specifid block and try again. Or if
       non empty label need to be written out, please use  -design  option  to
       specify the label to be written.

                          Version W-2024.09-SP3
            Copyright (c) 2025 Synopsys, Inc. All rights reserved.
fc_shell> 
fc_shell> 
fc_shell> puts "<<<END>>>"
<<<END>>>
fc_shell> 
fc_shell> 
fc_shell> puts "<<<CODE:LEFW-007>>>"
<<<CODE:LEFW-007>>>
fc_shell> 
fc_shell> 
fc_shell> man LEFW-007
N.  Messages                                                 Command Reference
                                   messages

NAME
       LEFW-007  (warning)  Use  %s  %s  as the WRONGDIRECTION width for layer
       '%s'.

DESCRIPTION
       Usually, if preferred routing direction  is  horizontal,  xDefaultWidth
       will  be  written out as the WRONGDIRECTION width; if preferred routing
       direction is  vertical,  yDefaultWidth  will  be  written  out  as  the
       WRONGDIRECTION  width.   This  warning  message indicates that the pre-
       ferred routing direction not exist, or is not horizontal  or  vertical,
       or  corresponding  xDefaultWidth/yDefaultWidth not exist. In that case,
       the tool will write out  the  specified  width  as  the  WRONGDIRECTION
       width.

WHAT NEXT
       Please  verify  whether  the reported width is truly the WRONGDIRECTION
       width for the specified layer.

                          Version W-2024.09-SP3
            Copyright (c) 2025 Synopsys, Inc. All rights reserved.
fc_shell> 
fc_shell> 
fc_shell> puts "<<<END>>>"
<<<END>>>
fc_shell> 
fc_shell> 
fc_shell> puts "<<<CODE:MV-013>>>"
<<<CODE:MV-013>>>
fc_shell> 
fc_shell> 
fc_shell> man MV-013
N.  Messages                                                 Command Reference
                                   messages

NAME
       MV-013  (warning)  %s  '%s' [supply net '%s', power state '%s'] is less
       always-on than the load pin '%s' [supply net '%s', power state '%s'].

DESCRIPTION
       This message occurs when the supply net of the specified driver pin  or
       PG  net  is  less always-on than the related supply net of the load pin
       and an Isolation Cell is missing. An Isolation Cell is required to iso-
       late  the  signal  path  if  the driver of the net is less always-on or
       unrelated to the load pin.

WHAT NEXT
       o Check the power states of the supply nets with report_pst.

       o  Use report_mv_path to report any Isolation strategy that  may  apply
       on the path.

       o   Check  analyze_mv_feasibility  for Isolation Cell and Enabled Level
       Shifter cell mapping related issues.

       o Check report_mv_lib_cells for availability of  a  suitable  Isolation
       Cells.

       o  Run report_mv_path -net -isolation to check if there is any strategy
       applied but not implemented.  If there is no strategy  applied,  please
       add necessary Isolation strategy.

SEE ALSO
       report_net(2)
       report_pst(2)
       report_mv_path(2)
       analyze_mv_feasibility(2)
       report_mv_lib_cells(2)

                          Version W-2024.09-SP3
            Copyright (c) 2025 Synopsys, Inc. All rights reserved.
fc_shell> 
fc_shell> 
fc_shell> puts "<<<END>>>"
<<<END>>>
fc_shell> 
fc_shell> 
fc_shell> puts "<<<CODE:MV-074>>>"
<<<CODE:MV-074>>>
fc_shell> 
fc_shell> 
fc_shell> man MV-074
N.  Messages                                                 Command Reference
                                   messages

NAME
       MV-074  (warning) The power switch cell '%s' is not associated with any
       power switch strategies.

DESCRIPTION
       This message is printed when the specified power  switch  cell  is  not
       associated with any power switch strategies.

       The  tool cannot associate power switch cells with power switch strate-
       gies if there are any discrepancies between them. In such a case,  sup-
       ply  net  connections of the power switch cells cannot be automatically
       derived by the tool. While it is sufficient to continue the implementa-
       tion  flow if supply net connections are explicitly specified, the tool
       will not be able to check and ensure that the power  switch  cells  are
       properly  inserted  and  consistent  with  the  power switch strategies
       intended for the cells.

WHAT NEXT
       Check the related power switch strategy  and  the  association  of  the
       power switch cell.

SEE ALSO
       associate_mv_cells(2)
       report_power_domains(2)
       report_cell(2)

                          Version W-2024.09-SP3
            Copyright (c) 2025 Synopsys, Inc. All rights reserved.
fc_shell> 
fc_shell> 
fc_shell> puts "<<<END>>>"
<<<END>>>
fc_shell> 
fc_shell> 
fc_shell> puts "<<<CODE:NDM-102>>>"
<<<CODE:NDM-102>>>
fc_shell> 
fc_shell> 
fc_shell> man NDM-102
N.  Messages                                                 Command Reference
                                   messages

NAME
       NDM-102  (warning)  Technology  '%s'  used  for  frame-view creation in
       library '%s', is inconsistent  with  the  current  technology  '%s'  of
       library  '%s'.  Please  run derive_design_level_via_regions to generate
       up-do-date via region in the design library.

DESCRIPTION
       The technology of the reference library is inconsistent with technology
       of  the  design library. Need to run derive_design_level_via_regions to
       generate up-do-date via region in the design library.

WHAT NEXT
       Update the library with consistent technology and  try  again.  Or  run
       derive_design_level_via_regions  to  generate  up-do-date via region in
       the design library.

SEE ALSO
       create_lib(2)
       open_lib(2)
       read_tech_file(2)
       derive_design_level_via_regions(2)

                          Version W-2024.09-SP3
            Copyright (c) 2025 Synopsys, Inc. All rights reserved.
fc_shell> 
fc_shell> 
fc_shell> puts "<<<END>>>"
<<<END>>>
fc_shell> 
fc_shell> 
fc_shell> puts "<<<CODE:NEX-020>>>"
<<<CODE:NEX-020>>>
fc_shell> 
fc_shell> 
fc_shell> man NEX-020
N.  Messages                                                 Command Reference
                                   messages

NAME
       NEX-020  (warning)   Net '%s' is exceeding threshold (over %d pins) and
       will be skipped.

DESCRIPTION
       This net has a very large number of pins so it will not  be  extracted.
       This  net was probably not meant to be detail routed.  There will be no
       parasitics and no back-annotated delay computed for this  net.   Timing
       analysis  will  use  the wire load model with the high fanout threshold
       assumptions.  The current default for the max number of pins  is  1000.
       You can use the option extract.high_fanout_threshold to adjust it.

WHAT NEXT
       Buffer this net and detail route it to be able to extract it.

SEE ALSO
       reg_extract_design(2)

                          Version W-2024.09-SP3
            Copyright (c) 2025 Synopsys, Inc. All rights reserved.
fc_shell> 
fc_shell> 
fc_shell> puts "<<<END>>>"
<<<END>>>
fc_shell> 
fc_shell> 
fc_shell> puts "<<<CODE:NEX-055>>>"
<<<CODE:NEX-055>>>
fc_shell> 
fc_shell> 
fc_shell> man NEX-055
N.  Messages                                                 Command Reference
                                   messages

NAME
       NEX-055 (warning) starrc_extract_rc: %s.

DESCRIPTION
       This  message advises you of the warning in starrc_extract_rc when run-
       ning StarRCInDesign or PT ECO fusion.

WHAT NEXT
        Invoke 'set_starrc_in_design'

                          Version W-2024.09-SP3
            Copyright (c) 2025 Synopsys, Inc. All rights reserved.
fc_shell> 
fc_shell> 
fc_shell> puts "<<<END>>>"
<<<END>>>
fc_shell> 
fc_shell> 
fc_shell> puts "<<<CODE:PDC-003>>>"
<<<CODE:PDC-003>>>
fc_shell> 
fc_shell> 
fc_shell> man PDC-003
N.  Messages                                                 Command Reference
                                   messages

NAME
       PDC-003 (Warning) Routing direction of metal layer %s is neither "hori-
       zontal" nor "vertical".  PDC checks  will  not  be  performed  on  this
       layer.

DESCRIPTION
       This  warning  message indicates that no routing direction has been set
       on the metal layer.  This may result in DRC violations due  to  illegal
       placement.

WHAT NEXT
       set_attribute  [get_layer <layer>] routing_direction <horizontal/verti-
       cal>

                          Version W-2024.09-SP3
            Copyright (c) 2025 Synopsys, Inc. All rights reserved.
fc_shell> 
fc_shell> 
fc_shell> puts "<<<END>>>"
<<<END>>>
fc_shell> 
fc_shell> 
fc_shell> puts "<<<CODE:POW-009>>>"
<<<CODE:POW-009>>>
fc_shell> 
fc_shell> 
fc_shell> man POW-009
N.  Messages                                                 Command Reference
                                   messages

NAME
       POW-009 (warning) Power analysis is disabled %s as leakage/swcap/inter-
       nal   mode   power   app   options   can   be    off    and/or    leak-
       age_power/dynamic_power scenario flags are set to false.

DESCRIPTION
       This  message  occurs  when  the  scenario power flags are false and/or
       leakage/swcap/internal app options are 'off'.

WHAT NEXT
       Set the required power analysis app option to 'on' and enable the  sce-
       nario power flags.

SEE ALSO
       report_power(2)
       report_scenarios(2)
       power.leakage_mode(3)
       power.swcap_mode(3)
       power.internal_mode(3)

                          Version W-2024.09-SP3
            Copyright (c) 2025 Synopsys, Inc. All rights reserved.
fc_shell> 
fc_shell> 
fc_shell> puts "<<<END>>>"
<<<END>>>
fc_shell> 
fc_shell> 
fc_shell> puts "<<<CODE:POW-046>>>"
<<<CODE:POW-046>>>
fc_shell> 
fc_shell> 
fc_shell> man POW-046
N.  Messages                                                 Command Reference
                                   messages

NAME
       POW-046 (warning) Power table extrapolation (%s mode) for port %s on %s
       for parameter %s. Lowest table value = %f, highest table  value  =  %f,
       value = %f

DESCRIPTION
       This  message  is  given  when a parameter during power table access is
       outside of the table range. Based on the mode, it will be  extrapolated
       or clipped to the range.

WHAT NEXT
       The  extrapolation mode can be set by app option power.table_extrapola-
       tion

SEE ALSO
       report_power(2)

                          Version W-2024.09-SP3
            Copyright (c) 2025 Synopsys, Inc. All rights reserved.
fc_shell> 
fc_shell> 
fc_shell> puts "<<<END>>>"
<<<END>>>
fc_shell> 
fc_shell> 
fc_shell> puts "<<<CODE:PVT-020>>>"
<<<CODE:PVT-020>>>
fc_shell> 
fc_shell> 
fc_shell> man PVT-020
N.  Messages                                                 Command Reference
                                   messages

NAME
       PVT-020 (warning) Mismatched voltage in corner %s.

DESCRIPTION
       This message is issued when a specified voltage value for some cells in
       a particular corner does not match any of the voltages supported by the
       cells' library.  Additional information will be printed identifying the
       relevant cell library, the number of affected cells,  and  the  voltage
       that will actually be used for timing analysis.

WHAT NEXT
       Review  the  P/V/T  operating conditions supported by the relevant cell
       library.  Review the constraints for missing or  incorrect  set_voltage
       commands.   Review  the  UPF data for an incorrect or incomplete supply
       net configuration.

                          Version W-2024.09-SP3
            Copyright (c) 2025 Synopsys, Inc. All rights reserved.
fc_shell> 
fc_shell> 
fc_shell> puts "<<<END>>>"
<<<END>>>
fc_shell> 
fc_shell> 
fc_shell> puts "<<<CODE:PVT-022>>>"
<<<CODE:PVT-022>>>
fc_shell> 
fc_shell> 
fc_shell> man PVT-022
N.  Messages                                                 Command Reference
                                   messages

NAME
       PVT-022 (warning) Mismatched process number in corner %s.

DESCRIPTION
       This message is issued when the specified process number for some cells
       in a particular corner does not match any of the process  numbers  sup-
       ported  by  the cells' library.  Additional information will be printed
       identifying the relevant cell library, the number  of  affected  cells,
       and the process number that will actually be used for timing analysis.

WHAT NEXT
       Review  the  P/V/T  operating conditions supported by the relevant cell
       library.    Review   the   constraints   for   missing   or   incorrect
       set_process_number  commands.   Review  the  constraints for missing or
       incorrect set_operating_conditions commands.

                          Version W-2024.09-SP3
            Copyright (c) 2025 Synopsys, Inc. All rights reserved.
fc_shell> 
fc_shell> 
fc_shell> puts "<<<END>>>"
<<<END>>>
fc_shell> 
fc_shell> 
fc_shell> puts "<<<CODE:PVT-030>>>"
<<<CODE:PVT-030>>>
fc_shell> 
fc_shell> 
fc_shell> man PVT-030
N.  Messages                                                 Command Reference
                                   messages

NAME
       PVT-030  (warning)  Corner %s:  %d process number, %d process label, %d
       voltage, and %d temperature mismatches.

DESCRIPTION
       This message is issued when there are mismatches between the  specified
       and  effective values of the process number, process label, voltage, or
       temperature  operating  conditions  of  a   particular   corner.    The
       report_pvt  command will print information and warnings identifying the
       mismatched values, the relevant cell libraries, the number of  affected
       cells, and the operating conditions that will actually be used for tim-
       ing analysis.

WHAT NEXT
       Review the P/V/T operating conditions supported by  the  relevant  cell
       libraries.   Review  whether  specified  P/V/T  is missing some library
       cells.  Review the constraints for missing  or  incorrect  set_voltage,
       set_temperature,  set_process_number, set_process_label, or set_operat-
       ing_conditions commands.  Review the  UPF  data  for  an  incorrect  or
       incomplete  supply net configuration.  The report_pvt command will give
       more information about this situation.

                          Version W-2024.09-SP3
            Copyright (c) 2025 Synopsys, Inc. All rights reserved.
fc_shell> 
fc_shell> 
fc_shell> puts "<<<END>>>"
<<<END>>>
fc_shell> 
fc_shell> 
fc_shell> puts "<<<CODE:PVT-031>>>"
<<<CODE:PVT-031>>>
fc_shell> 
fc_shell> 
fc_shell> man PVT-031
N.  Messages                                                 Command Reference
                                   messages

NAME
       PVT-031 (warning)  %d cells affected for early, %d for late.

DESCRIPTION
       This  message is issued when there are mismatches between the specified
       and effective values of the process number, process label, voltage,  or
       temperature  operating conditions of a particular corner.  It describes
       the number of cells affected by the mismatched PVT values.  It will  be
       preceded by a PVT-030 warning, which lists the number of mismatches.

WHAT NEXT
       Review  the  P/V/T  operating conditions supported by the relevant cell
       libraries.  Review the constraints for missing or  incorrect  set_volt-
       age,   set_temperature,   set_process_number,   set_process_label,   or
       set_operating_conditions commands.  Review the UPF data for  an  incor-
       rect  or  incomplete  supply net configuration.  The report_pvt command
       will give more information about this situation.

                          Version W-2024.09-SP3
            Copyright (c) 2025 Synopsys, Inc. All rights reserved.
fc_shell> 
fc_shell> 
fc_shell> puts "<<<END>>>"
<<<END>>>
fc_shell> 
fc_shell> 
fc_shell> puts "<<<CODE:PVT-033>>>"
<<<CODE:PVT-033>>>
fc_shell> 
fc_shell> 
fc_shell> man PVT-033
N.  Messages                                                 Command Reference
                                   messages

NAME
       PVT-033 (warning) %d voltage and %d temperature extrapolations.

DESCRIPTION
       This  message  is issued when voltage or temperature scaling is happen-
       ing, and the specified voltage or temperature values for some  part  of
       the  design  are  outside the ranges supported by a cell library.  This
       situation can degrate the accuracy of the timer's delay and slew calcu-
       lations.

WHAT NEXT
       Review  the  V/T  operating  conditions  supported by the relevant cell
       libraries.  Review the constraints for missing or  incorrect  set_volt-
       age, set_temperature, or set_operating_conditions commands.  Review the
       UPF data for an incorrect or incomplete supply net configuration.   The
       report_pvt command will give more information about this situation.

                          Version W-2024.09-SP3
            Copyright (c) 2025 Synopsys, Inc. All rights reserved.
fc_shell> 
fc_shell> 
fc_shell> puts "<<<END>>>"
<<<END>>>
fc_shell> 
fc_shell> 
fc_shell> puts "<<<CODE:PVT-034>>>"
<<<CODE:PVT-034>>>
fc_shell> 
fc_shell> 
fc_shell> man PVT-034
N.  Messages                                                 Command Reference
                                   messages

NAME
       PVT-034  (warning)   %d  port  driving_cells affected for early, %d for
       late.

DESCRIPTION
       This message is issued when there are mismatches between the  specified
       and  effective values of the process number, process label, voltage, or
       temperature operating conditions of a particular corner.  It  describes
       the number of port driving_cells affected by the mismatched PVT values.
       It will be preceded by a PVT-030 warning, which  lists  the  number  of
       mismatches.

WHAT NEXT
       Review  the  P/V/T  operating conditions supported by the relevant cell
       libraries.  Review the constraints for missing or  incorrect  set_volt-
       age,   set_temperature,   set_process_number,   set_process_label,   or
       set_operating_conditions commands applied to the port or the top  level
       of the design.  The report_pvt command will give more information about
       this situation for a particular port.

                          Version W-2024.09-SP3
            Copyright (c) 2025 Synopsys, Inc. All rights reserved.
fc_shell> 
fc_shell> 
fc_shell> puts "<<<END>>>"
<<<END>>>
fc_shell> 
fc_shell> 
fc_shell> puts "<<<CODE:SEL-004>>>"
<<<CODE:SEL-004>>>
fc_shell> 
fc_shell> 
fc_shell> man SEL-004
N.  Messages                                                 Command Reference
                                   messages

NAME
       SEL-004 (warning) No %s objects matched '%s'

DESCRIPTION
       The  pattern which you specified did not match any objects of the class
       acceptable for this command.

WHAT NEXT
       Check the pattern to see if it is what you expected.

                          Version W-2024.09-SP3
            Copyright (c) 2025 Synopsys, Inc. All rights reserved.
fc_shell> 
fc_shell> 
fc_shell> puts "<<<END>>>"
<<<END>>>
fc_shell> 
fc_shell> 
fc_shell> puts "<<<CODE:TIM-204>>>"
<<<CODE:TIM-204>>>
fc_shell> 
fc_shell> 
fc_shell> man TIM-204
N.  Messages                                                 Command Reference
                                   messages

NAME
       TIM-204  (Warning)  Advanced  receiver  model  has not been enabled for
       detailed routed design.

DESCRIPTION
       Advanced reciever model  has  not  been  enabled  for  detailed  routed
       design.   For  improving accuracy of delay calculation and to correlate
       with PrimeTime,  it  is  recommended  to  set  the  application  option
       'time.enable_ccs_rcv_cap' to true.

WHAT NEXT
       Enable time.enable_ccs_rcv_cap for signoff accurate delay calculation.

                          Version W-2024.09-SP3
            Copyright (c) 2025 Synopsys, Inc. All rights reserved.
fc_shell> 
fc_shell> 
fc_shell> puts "<<<END>>>"
<<<END>>>
fc_shell> 
fc_shell> 
fc_shell> puts "<<<CODE:TIM-207>>>"
<<<CODE:TIM-207>>>
fc_shell> 
fc_shell> 
fc_shell> man TIM-207
N.  Messages                                                 Command Reference
                                   messages

NAME
       TIM-207  (Warning)  Libraries  do not have CCS noise model for accurate
       waveform analysis in advanced waveform propagation mode.

DESCRIPTION
       When advanced waveform propagation analysis is enabled, it is  required
       that  the  stage driver cell has CCS noise model(s) for its timing arcs
       in  terms of  either  arc-based  or   pin-based   CCS  noise  model(s).
       When  such CCS noise model(s) are not present in the library,  analysis
       with  desired accuracy cannot be performed.

WHAT NEXT
       Fix the library to ensure that all library cell timing arcs have either
       arc-based or pin-based CCS noise models.

SEE ALSO
       time.delay_calc_waveform_analysis_mode (3)
       time.awp_compatibility_mode (3)

                          Version W-2024.09-SP3
            Copyright (c) 2025 Synopsys, Inc. All rights reserved.
fc_shell> 
fc_shell> 
fc_shell> puts "<<<END>>>"
<<<END>>>
fc_shell> 
fc_shell> 
fc_shell> puts "<<<CODE:TIM-260>>>"
<<<CODE:TIM-260>>>
fc_shell> 
fc_shell> 
fc_shell> man TIM-260
N.  Messages                                                 Command Reference
                                   messages

NAME
       TIM-260  (Warning)  Library %s is pre-18.06 version %u.%u,  Correlation
       with Primetime can be low.

DESCRIPTION
       ICC2 Primetime delay calculation can work with reference library  built
       by  version  later  than  2018.06  only.  If reference library is built
       before 2018.06, delay calculation can have poor corrleation with Prime-
       time.

WHAT NEXT
       Rebuild  the  reference library with library manager version later than
       2018.06, or turn on library  configuration  app  option  lib.configura-
       tion.update_timing_view_for_pt_delay

                          Version W-2024.09-SP3
            Copyright (c) 2025 Synopsys, Inc. All rights reserved.
fc_shell> 
fc_shell> 
fc_shell> puts "<<<END>>>"
<<<END>>>
fc_shell> 
fc_shell> 
fc_shell> puts "<<<CODE:UIC-058>>>"
<<<CODE:UIC-058>>>
fc_shell> 
fc_shell> 
fc_shell> man UIC-058
N.  Messages                                                 Command Reference
                                   messages

NAME
       UIC-058  (warning) Scenario %s is not configured for %s analysis: skip-
       ping.

DESCRIPTION
       The specified scenario has not been activated for setup or hold  analy-
       sis.   Because  of this, no setup or hold timing paths can be found for
       it.

WHAT NEXT
       If setup or hold analysis is deliberately being skipped for  this  sce-
       nario,  this  warning  can  be  ignored.   Otherwise,  use the set_sce-
       nario_status command to activate this scenario for setup or hold analy-
       sis.

                          Version W-2024.09-SP3
            Copyright (c) 2025 Synopsys, Inc. All rights reserved.
fc_shell> 
fc_shell> 
fc_shell> puts "<<<END>>>"
<<<END>>>
fc_shell> 
fc_shell> 
fc_shell> puts "<<<CODE:UIED-180>>>"
<<<CODE:UIED-180>>>
fc_shell> 
fc_shell> 
fc_shell> man UIED-180
N.  Messages                                                 Command Reference
                                   messages

NAME
       UIED-180 (error) Failed to add buffers

DESCRIPTION
       The command failed to add any buffers.

WHAT NEXT
       Review errors from the command, before this one to proceed.

                          Version W-2024.09-SP3
            Copyright (c) 2025 Synopsys, Inc. All rights reserved.
fc_shell> 
fc_shell> 
fc_shell> puts "<<<END>>>"
<<<END>>>
fc_shell> 
fc_shell> 
fc_shell> puts "<<<CODE:UIED-304>>>"
<<<CODE:UIED-304>>>
fc_shell> 
fc_shell> 
fc_shell> man UIED-304
N.  Messages                                                 Command Reference
                                   messages

NAME
       UIED-304  (error)  Can't  find place to insert buffer by given location
       (%.4f, %.4f).

DESCRIPTION
       This error occurs when add_buffer_on_route can't find a route object to
       insert  buffer  on, within a region around the user given location. The
       region is specified by -max_distance_to_route.

SEE ALSO
       add_buffer_on_route(2)

WHAT NEXT
       You can re-assign the location (e.g. to be more close to the route) and
       try again.

                          Version W-2024.09-SP3
            Copyright (c) 2025 Synopsys, Inc. All rights reserved.
fc_shell> 
fc_shell> 
fc_shell> puts "<<<END>>>"
<<<END>>>
fc_shell> 
fc_shell> 
fc_shell> puts "<<<CODE:UIED-309>>>"
<<<CODE:UIED-309>>>
fc_shell> 
fc_shell> 
fc_shell> man UIED-309
N.  Messages                                                 Command Reference
                                   messages

NAME
       UIED-309  (Error)  Add  buffer on route fail to get or process route of
       net %s

DESCRIPTION
       Could not get or process route of a net

WHAT NEXT
       Check whether the net is valid

                          Version W-2024.09-SP3
            Copyright (c) 2025 Synopsys, Inc. All rights reserved.
fc_shell> 
fc_shell> 
fc_shell> puts "<<<END>>>"
<<<END>>>
fc_shell> 
fc_shell> 
fc_shell> puts "<<<CODE:UIED-313>>>"
<<<CODE:UIED-313>>>
fc_shell> 
fc_shell> 
fc_shell> man UIED-313
N.  Messages                                                 Command Reference
                                   messages

NAME
       UIED-313 (Warning) Failed to add buffer on net %s

DESCRIPTION
       Could not add buffer with current parameters on the net

WHAT NEXT
       Run the command with different parameters

                          Version W-2024.09-SP3
            Copyright (c) 2025 Synopsys, Inc. All rights reserved.
fc_shell> 
fc_shell> 
fc_shell> puts "<<<END>>>"
<<<END>>>
fc_shell> 
fc_shell> 
fc_shell> puts "<<<CODE:UPF-236>>>"
<<<CODE:UPF-236>>>
fc_shell> 
fc_shell> 
fc_shell> man UPF-236
N.  Messages                                                 Command Reference
                                   messages

NAME
       UPF-236  (warning)  Crosstool  app  option  is set to true, UPF may not
       match Verilog or SPEF.

DESCRIPTION
       This    Warning    message    occurs    when     the     app     option
       mv.upf.write_crosstool_wrappers   is   set  to  true.  The  app  option
       mv.upf.write_crosstool_wrappers is needed for exporting UPF  for  tools
       that do not support the use of  power domain on instance (PDOI) in UPF.
       With the app option set to true, instances that are  PDOI  are  grouped
       under  derived  hierarchical  modules  to resolved compatibility issues
       with other tools. The derived hierarchies are only added  during  ASCII
       output and are not represented in the block. The ASCII outputs that are
       affected are Verilog and SPEC from write_verilog  and  write_parasitics
       commands.  The  app  option does not impact the output of save_upf com-
       mand. That means logical mismatches can  exist  between  the  UPF  from
       save_upf command and SPEF or Verilog netlist.

       To  write a compatible UPF that includes the hierarchical wrappers, use
       the write_verilog  command.  When  the  app  option  is  set  to  true,
       write_verilog  will write a Verilog netlist and a compatible UPF at the
       same time.  The UPF will have the same name as the  Verilog  file  with
       the added extension ".SNPS.upf".

WHAT NEXT
       If   you   have  a  multi-voltage  design  and  are  allowing  physical
       feedthrough buffers (opt.common.allow_physical_feedthroughset is  true)
       to  be  added during optimization and CTS, then you should use the com-
       patible UPF created by the write_verilog command for  ASCII  import  to
       other tools.

       If  you  are not allowing any physical feedthrough buffers during opti-
       mization and CTS, you can ignore this warning or  set  the  app  option
       mv.upf.write_crosstool_wrappers to false to avoid this message.

SEE ALSO
       write_verilog(2)
       write_parasitics(2)
       save_upf(2)
       opt.common.allow_physical_feedthrough(3)
       mv.upf.write_crosstool_wrappers(3)

                          Version W-2024.09-SP3
            Copyright (c) 2025 Synopsys, Inc. All rights reserved.
fc_shell> 
fc_shell> 
fc_shell> puts "<<<END>>>"
<<<END>>>
fc_shell> 
fc_shell> 
fc_shell> puts "<<<CODE:ZRT-022>>>"
<<<CODE:ZRT-022>>>
fc_shell> 
fc_shell> 
fc_shell> man ZRT-022
N.  Messages                                                 Command Reference
                                   messages

NAME
       ZRT-022 (warn) Cannot find a default contact code for layer %s.

DESCRIPTION
       This  warning  message  indicates  that  a default contact code was not
       found for the specified layer. This is most likely  due  to  a  missing
       default contact code definition in the technology file.

WHAT NEXT
       Add  a  default  contact code definition to the technology file. If the
       specified layer is a nonrouting layer, such as V0, you can ignore  this
       message.

                          Version W-2024.09-SP3
            Copyright (c) 2025 Synopsys, Inc. All rights reserved.
fc_shell> 
fc_shell> 
fc_shell> puts "<<<END>>>"
<<<END>>>
fc_shell> 
fc_shell> 
fc_shell> puts "<<<CODE:ZRT-027>>>"
<<<CODE:ZRT-027>>>
fc_shell> 
fc_shell> 
fc_shell> man ZRT-027
N.  Messages                                                 Command Reference
                                   messages

NAME
       ZRT-027 (warn) Ignore %d top cell ports with no pins.

DESCRIPTION
       This  warning  message indicates that the design's top cell has logical
       ports which have no physical shapes attached to them.  The router  will
       ignore such ports.

WHAT NEXT
       Please check the top cell and create physical shapes for those ports if
       needed.

                          Version W-2024.09-SP3
            Copyright (c) 2025 Synopsys, Inc. All rights reserved.
fc_shell> 
fc_shell> 
fc_shell> puts "<<<END>>>"
<<<END>>>
fc_shell> 
fc_shell> 
fc_shell> puts "<<<CODE:ZRT-044>>>"
<<<CODE:ZRT-044>>>
fc_shell> 
fc_shell> 
fc_shell> man ZRT-044
N.  Messages                                                 Command Reference
                                   messages

NAME
       ZRT-044 (warn) Standard cell pin %s/%s has no valid via regions.

DESCRIPTION
       Via  regions  are  useful  in  avoiding  DRCs  in accessing pins and in
       accessing pins off the routing grid. It is defined  with  the  matching
       via specified by the contact code number.

WHAT NEXT
       Please  check  for  DRCs  in  accessing this pin, and check ZRT-038 for
       error in contact code number, and generate the via  regions  if  neces-
       sary.

                          Version W-2024.09-SP3
            Copyright (c) 2025 Synopsys, Inc. All rights reserved.
fc_shell> 
fc_shell> 
fc_shell> puts "<<<END>>>"
<<<END>>>
fc_shell> 
fc_shell> 
fc_shell> puts "<<<CODE:ZRT-101>>>"
<<<CODE:ZRT-101>>>
fc_shell> 
fc_shell> 
fc_shell> man ZRT-101
N.  Messages                                                 Command Reference
                                   messages

NAME
       ZRT-101 (warning) Power net %s has no power preroutes, skip tie-off.

DESCRIPTION
       Power  net  has no power preroutes. Tie-off will be turned off for this
       net.

WHAT NEXT
       Please add power preroutes.

                          Version W-2024.09-SP3
            Copyright (c) 2025 Synopsys, Inc. All rights reserved.
fc_shell> 
fc_shell> 
fc_shell> puts "<<<END>>>"
<<<END>>>
fc_shell> 
fc_shell> 
fc_shell> puts "<<<CODE:ZRT-142>>>"
<<<CODE:ZRT-142>>>
fc_shell> 
fc_shell> 
fc_shell> man ZRT-142
N.  Messages                                                 Command Reference
                                   messages

NAME
       ZRT-142 (warn) PG net %s has a %s shape with shape_use detail_route and
       it is too long. Long part of the  shape  is  located  at  (%.3f,  %.3f)
       (%.3f, %.3f). The shape's BBox is (%.3f, %.3f) (%.3f, %.3f).

DESCRIPTION
       In  general,  a  PG wire with shape_use detail_route is a tie-off wire.
       However, a very long PG wire could be  a  part  of  PG  mesh  or  rail.
       Please  review and correct the shape_use of the shape reported.  Please
       be noted, this check only detects suspicious ones, not all of them.

WHAT NEXT
       Review and correct the shape_use of the shape reported.

       The user could run check_routability -check_shield true to get a report
       of  shield  data issues.  The user could also use set_app_options -name
       route.common.check_shield -value true to enable shield data checker  in
       all Zroute commands.

                          Version W-2024.09-SP3
            Copyright (c) 2025 Synopsys, Inc. All rights reserved.
fc_shell> 
fc_shell> 
fc_shell> puts "<<<END>>>"
<<<END>>>
fc_shell> 
fc_shell> 
fc_shell> puts "<<<CODE:ZRT-143>>>"
<<<CODE:ZRT-143>>>
fc_shell> 
fc_shell> 
fc_shell> man ZRT-143
N.  Messages                                                 Command Reference
                                   messages

NAME
       ZRT-143  (warning)  Secondary  PG  net  %s has no power stripe, skip to
       route.

DESCRIPTION
       Secondary PG net has no power stripe to connect.

WHAT NEXT
       Please add power stripe.

                          Version W-2024.09-SP3
            Copyright (c) 2025 Synopsys, Inc. All rights reserved.
fc_shell> 
fc_shell> 
fc_shell> puts "<<<END>>>"
<<<END>>>
fc_shell> 
fc_shell> 
fc_shell> puts "<<<CODE:ZRT-311>>>"
<<<CODE:ZRT-311>>>
fc_shell> 
fc_shell> 
fc_shell> man ZRT-311
N.  Messages                                                 Command Reference
                                   messages

NAME
       ZRT-311  (warning)  Skipping antenna analysis for net %s. The pin %s on
       cell %s does not have enough gate area information.

DESCRIPTION
       One or more input pins of this net do not have the  correct  gate  area
       values.  So antenna analysis will not be done for this net.

       Limit for number of ZRT-311 messages is set to 100 by default for read-
       ability of the log file. In order to print more or all the ZRT-311 mes-
       sages,  set  this  message  limit to a very large number using set_mes-
       sage_info command.

WHAT NEXT
       Check and set correct gate area for all the input pins of  the  net  on
       all the metal & cut layers.
        If gate area of some pins is not available, consider using app options
       route.detail.default_gate_size   and   route.detail.default_port_exter-
       nal_gate_size.  Value set for these options will be used for pins with-
       out gate area information during antenna analysis.

       If the gate area is unspecified but the diffusion area is specified for
       some  pins, and you want to use the diffusion area for antenna analysis
       for   such   pins,    then    set    app    option    route.detail.ana-
       lyze_antenna_for_pins_with_diffusion_area to true.

                          Version W-2024.09-SP3
            Copyright (c) 2025 Synopsys, Inc. All rights reserved.
fc_shell> 
fc_shell> 
fc_shell> puts "<<<END>>>"
<<<END>>>
fc_shell> 
fc_shell> 
fc_shell> puts "<<<CODE:ZRT-543>>>"
<<<CODE:ZRT-543>>>
fc_shell> 
fc_shell> 
fc_shell> man ZRT-543
N.  Messages                                                 Command Reference
                                   messages

NAME
       ZRT-543  (warn)  Shape {%d %d %d %d} on layer %s is not on min manufac-
       turing grid. Snap it to {%d %d %d %d}. The shape belongs to Net: %s.

DESCRIPTION
       Each edge of a shape should always be on the min manufacture  grid.  If
       this is not satisfied, DRC checking can't be accurate. This rule should
       apply to all the features on the layout.

WHAT NEXT
       If the off minGrid shape is a fixed shape from the libary, try  to  fix
       them  manully. If the shape is a routable shape, it should be automati-
       clly fixed after running detailed route.

                          Version W-2024.09-SP3
            Copyright (c) 2025 Synopsys, Inc. All rights reserved.
fc_shell> 
fc_shell> 
fc_shell> puts "<<<END>>>"
<<<END>>>
fc_shell> 
fc_shell> 
fc_shell> puts "<<<CODE:ZRT-626>>>"
<<<CODE:ZRT-626>>>
fc_shell> 
fc_shell> 
fc_shell> man ZRT-626
N.  Messages                                                 Command Reference
                                   messages

NAME
       ZRT-626  (warning)  High  fanout  net %s can affect runtime for antenna
       fixing.

DESCRIPTION
       The design has high fanout nets and antenna fixing is turned on.   Run-
       time of antenna check and fixing is affected by high fanout nets.

WHAT NEXT
       Please  check  the  design  and  address the high fanout net issue.  If
       antenna check is not needed for these nets, consider setting app option
       route.detail.max_antenna_pin_count.                              Option
       "route.detail.max_antenna_pin_count" specifies the  maximum  number  of
       pins on a net on which antenna checking is performed.

                          Version W-2024.09-SP3
            Copyright (c) 2025 Synopsys, Inc. All rights reserved.
fc_shell> 
fc_shell> 
fc_shell> puts "<<<END>>>"
<<<END>>>
fc_shell> 
fc_shell> 
fc_shell> puts "<<<CODE:ZRT-740>>>"
<<<CODE:ZRT-740>>>
fc_shell> 
fc_shell> 
fc_shell> man ZRT-740
N.  Messages                                                 Command Reference
                                   messages

NAME
       ZRT-740 (warning)  %s is unplaced.  This may impact routing result.

DESCRIPTION
       A port is unplaced.  This is atypical and may impact routing result.

WHAT NEXT
       If this is not expected, please fix the issue.

                          Version W-2024.09-SP3
            Copyright (c) 2025 Synopsys, Inc. All rights reserved.
fc_shell> 
fc_shell> 
fc_shell> puts "<<<END>>>"
<<<END>>>
fc_shell> 
fc_shell> 
fc_shell> puts "<<<CODE:ZRT-825>>>"
<<<CODE:ZRT-825>>>
fc_shell> 
fc_shell> 
fc_shell> man ZRT-825
N.  Messages                                                 Command Reference
                                   messages

NAME
       ZRT-825  (Warning)  Pin or route connects to PG user_route (%.3f, %.3f,
       %.3f, %.3f) on layer (%s) is considered  as  tied.  Would  not  further
       check or build connectivity to tie to other PG pre-routes.

DESCRIPTION
       This  warning  is issued for possible incorrect usage of PG user_route.
       In router, pins or routes connect to PG user_routes are treated as con-
       nected  to  pre-routes. Router will not take them as opens or floatings
       which need further tie off connections.

WHAT NEXT
       Set the user_route to other shape_use if necessary.

                          Version W-2024.09-SP3
            Copyright (c) 2025 Synopsys, Inc. All rights reserved.
fc_shell> 
fc_shell> 
fc_shell> puts "<<<END>>>"
<<<END>>>
fc_shell> 
fc_shell> 
fc_shell> exit
Maximum memory usage for this session: 369.32 MB
Maximum memory usage for this session including child processes: 369.32 MB
CPU usage for this session:      6 seconds (  0.00 hours)
Elapsed time for this session:      6 seconds (  0.00 hours)
Thank you for using Fusion Compiler.

